<!--Información del curso-->
<img align="left" style="padding-right:10px;" src="figuras/banner_cd.png">

# Parte 2

# Ejercicio

<div class="alert alert-success">

**Creación de un DataFrame con series y diccionarios**
    
1. Definir un DataFrame a partir de 4 series y cada Serie a partir de un diccionario. 
</div>

Ejemplo:


``` python
Alan = pd.Series({'Edad': 20 ,
                  'Altura': 1.70,
                  'Peso': 68,
                  'Estado': 'Yucatán',
                  'Color favorito':'Azul',
                  'Licenciatura': 'Derecho'})
María = pd.Series({'Edad': 21 ,
                   'Altura': 1.80,
                   'Peso': 80,
                   'Color favorito':'Rojo',
                   'Licenciatura': 'Ingeniería'})
Pedro = pd.Series({'Edad': 23 ,
                   'Altura': 1.67,
                   'Peso': 75,
                   'Estado': 'Aguascalientes',
                   'Color favorito':'Morado',
                   'Licenciatura': 'Artes'})
Esmeralda = pd.Series({'Edad': 25 ,
                       'Altura': 1.72,
                       'Peso': 60,
                       'Estado': 'Campeche',
                       'Licenciatura': 'Turismo'})
Karen = pd.Series({'Edad': 25 ,
                  'Altura': 1.74,
                  'Peso': 69,
                  'Estado': '',
                  'Color favorito':'Azul',
                  'Licenciatura': 'Psicología'})

df_alumnos = pd.DataFrame({'Alan':Alan,
                           'María': María, 
                           'Pedro': Pedro, 
                           'Esmeralda': Esmeralda, 
                           'Karen': Karen
                           })
df_alumnos

```

In [18]:
import pandas as pd

ford = pd.Series({
    "pais" : "Estados Unidos",
    "fundacion" : 1903,
    "modelos" : ["Mustang", "Focus", "Explorer"]
})
toyota = pd.Series({
    "pais": "Japón",
    "fundacion": 1937,
    "modelos": ["Corolla", "Camry", "Hilux", "Supra"]
})
bmw = pd.Series({
    "pais": "Alemania",
    "fundacion": 1916,
    "modelos": ["Serie 3", "X5", "i8", "M4"]
})
ferrari = pd.Series({
    "pais": "Italia",
    "fundacion": 1939,
    "modelos": ["488", "LaFerrari", "F8 Tributo", "Roma"]
})

In [19]:
df_marcas_autos = pd.DataFrame({
    "Ford" : ford,
    "Toyota": toyota,
    "BMW" : bmw,
    "Ferrari": ferrari
})

df_marcas_autos

,Ford,Toyota,BMW,Ferrari
pais,Estados Unidos,Japón,Alemania,Italia
fundacion,1903,1937,1916,1939
modelos,"[Mustang, Focus, Explorer]","[Corolla, Camry, Hilux, Supra]","[Serie 3, X5, i8, M4]","[488, LaFerrari, F8 Tributo, Roma]"

# Parte 2

# Ejercicios con los datos del Titanic

Descripción de las columnas :

    Survival - Supervivencia (0 = No; 1 = Si).
    Pclass - Clase (1 = 1st; 2 = 2nd; 3 = 3rd)
    Name - Nombre
    Sex - Sexo
    Age - Edad
    Sibsp - Número de hermanos / cónyuges a bordo
    Parch - Número de padres / niños a bordo
    Ticket - Número de ticket
    Fare - Tarifa
    Cabin - Número de cabina
    Embarked - Puerto de embarque (C = Cherbourg; Q = Queenstown; S = Southampton)

In [20]:
#Utilizar el archivo datos/titanic.csv
df = pd.read_csv("datos/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
#muestre las primeras líneas del DataFrame
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<div class="alert alert-success">

<b>EJERCICIO 1 </b>: 
    
    
Encontrar el promedio de edad para los pasajeros de cada clase.
    
    
</div>

In [22]:
print(f'Prom. edad 1ra clase: {(df[df["Pclass"] == 1]["Age"].mean())}')
print(f'Prom. edad 2da clase: {(df[df["Pclass"] == 2]["Age"].mean())}')
print(f'Prom. edad 3ra clase: {(df[df["Pclass"] == 3]["Age"].mean())}')

Prom. edad 1ra clase: 38.233440860215055
Prom. edad 2da clase: 29.87763005780347
Prom. edad 3ra clase: 25.14061971830986

<div class="alert alert-success">

<b>EJERCICIO 2</b>: 
  
Encontrar el número total de pasajeros por cada punto de embarcación.     
    
</div>

In [58]:
print(f'Pasajeros en Cherbourg: {len(df[df["Embarked"]=="C"])}')
print(f'Pasajeros en Queenstown: {len(df[df["Embarked"]=="Q"])}')
print(f'Pasajeros en Southampton: {len(df[df["Embarked"]=="S"])}')

Pasajeros en Cherbourg: 168
Pasajeros en Queenstown: 77
Pasajeros en Southampton: 644

<div class="alert alert-success">

<b>EJERCICIO 3</b>: 
  
a) Encontrar el promedio de edad de los pasajeros que sobrevivieron. 
    
b) Encontrar el promedio de edad de los hombres que sobrevivieron
    
c) Encontrar el promedio de edad de las mujeres que sobrevivieron
</div>

#### a) Promedio de edad de sobrevivientes

In [28]:
print(df[df["Survived"] == 1]["Age"].mean())

28.343689655172415

#### b) Promedio de edad de hombres sobrevivientes

In [30]:
print(df[(df["Survived"] == 1) & (df["Sex"] == "male")]["Age"].mean())

27.276021505376345

#### c) Promedio de edad de mujeres sobrevivientes

In [31]:
print(df[(df["Survived"] == 1) & (df["Sex"] == "female")]["Age"].mean())

28.84771573604061

<div class="alert alert-success">

<b>EJERCICIO 4</b>: 
  
¿Cuál fue el número de sobrevivientes mujeres  mayores a 40 años? 

</div>

In [59]:
len(df[(df["Survived"] == 1) & (df["Sex"] == "female") & (df["Age"] > 40)])

37

<div class="alert alert-success">

<b>EJERCICIO 5</b>: 
  
La edad del más joven y de la persona de mayor edad. 

</div>

In [65]:
print(f'Menor edad: {df["Age"].min()}')
print(f'Mayor edad: {df["Age"].max()}')

Menor edad: 0.42
Mayor edad: 80.0

# Parte 2:  Escuelas de Jalisco 
Utilizar los datos del archivo "cct_estadistica_short.csv" para realizar los siguientes ejercicios

In [ ]:
#Leer los datos 
df = pd.read_csv('datos/cct_estadistica_short.csv',  encoding='latin1')

In [ ]:
#Desplegar parte del dataframe
df.head()

In [ ]:
#Resumen estadistico de los campos
df.describe()

In [ ]:
#Mostrar los nombres de las columnas del dataframe
df.columns

<div class="alert alert-success">
    <b>EJERCICIO 6 </b>:
 <ul>
  <li> Encuentre el número de estudiantes por nivel educativo (PRIMARIA, SECUNDARIA y BACHILLERATO). </li>
</ul> 

</div>

<div class="alert alert-success">
    <b>EJERCICIO 7 </b>:
 <ul>
  <li>  Encuentre el número de estudiantes hombres y mujeres por nivel educativo (PRIMARIA, SECUNDARIA y BACHILLERATO).    </li>
</ul> 

</div>

<div class="alert alert-success">
    <b>EJERCICIO 8 </b>:
 <ul>
  <li>  ¿Cuál es el promedio de docentes por nivel educativo?  </li>
</ul> 

</div>

<div class="alert alert-success">
    <b>EJERCICIO 9 </b>:
 <ul>
  <li>   Encuentre el porcentaje de  escuelas Particulares </li>
</ul> 

</div>

<div class="alert alert-success">
    <b>EJERCICIO 10 </b>:
 <ul>
  <li>   Encuentre el porcentaje de  escuelas PREESCOLAR, PRIMARIA,  SECUNDARIA y BACHILLERATO  </li>
</ul> 

</div>